Core/src/Catalogs/ПрайсЛисты/ПрайсЛисты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрайсЛисты</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантыСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьДатуФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНоменклатуруБезЦен</name>
    <comment>Выводить номенклатуру даже в том случае, если нет установленных цен.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаКурсаВалюты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияСодержимого</name>
    <type>
      <types>EnumRef.ИерархияПрайсЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьРазмерПропорционально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаВысота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаШирина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеЦеныПредставлением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтмечатьНовинки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЦен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьПрайсЛиста</name>
    <type>
      <types>EnumRef.ВариантыПечатиПрайсЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеТекстаОтносительноМеткиНовинка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОстатков</name>
    <comment>1 - числом, 2 - ассоциативное представление</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковДостаточно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковМало</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеПредставлениеОстатковМного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоНаличию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредставлениеНоменклатуры</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрРасшифровки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СлужебныйУправлениеВидимостью</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииНоменклатуры</name>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ПрайсЛисты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СоздатьНовуюТаблицуРеквизитов(ДоступныеПоля)
	
	ДоступныеПоля = Новый ТаблицаЗначений;
	ДоступныеПоля.Колонки.Добавить("Использование");
	ДоступныеПоля.Колонки.Добавить("РеквизитНоменклатуры");
	ДоступныеПоля.Колонки.Добавить("РеквизитПредставление");
	ДоступныеПоля.Колонки.Добавить("ПараметрРасшифровки");
	ДоступныеПоля.Колонки.Добавить("Ширина");
	ДоступныеПоля.Колонки.Добавить("СлужебныйУправлениеВидимостью");
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Использование, РеквизитНоменклатуры, РеквизитПредставление, ПараметрРасшифровки = "", Ширина, СлужебныйУправлениеВидимостью = Истина)
	
	НоваяСтрока							= ДоступныеПоля.Добавить();
	НоваяСтрока.Использование			= Использование;
	НоваяСтрока.РеквизитНоменклатуры	= РеквизитНоменклатуры;
	НоваяСтрока.РеквизитПредставление	= РеквизитПредставление;
	НоваяСтрока.ПараметрРасшифровки		= ПараметрРасшифровки;
	НоваяСтрока.Ширина					= Ширина;
	НоваяСтрока.СлужебныйУправлениеВидимостью = СлужебныйУправлениеВидимостью;
	
КонецПроцедуры

Процедура ДоступныеПоляНоменклатуры(ДоступныеПоля) Экспорт
	
	СоздатьНовуюТаблицуРеквизитов(ДоступныеПоля);
	
	ИспользованиеХарактеристик = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	ПредставлениеКолонки = НСтр("ru='Картинка';ka='სურათი';en='Picture'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Картинка",				"Картинка",				"НоменклатураСсылка",			8);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Картинка",				ПредставлениеКолонки,				"НоменклатураСсылка",			8);
	
	ПредставлениеКолонки = НСтр("ru='Код';ka='კოდი';en='Code'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Код",					"Код",					"НоменклатураСсылка",			11);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Код",					ПредставлениеКолонки,					"НоменклатураСсылка",			11);
	
	ПредставлениеКолонки = НСтр("ru='Артикул';ka='არტიკული';en='vendor code'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Артикул",				"Артикул",				"НоменклатураСсылка",			11);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Артикул",				ПредставлениеКолонки,				"НоменклатураСсылка",			11);
	
	ПредставлениеКолонки = НСтр("ru='Наименование';ka='დასახელება';en='Name'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Наименование",			"Наименование",			"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Наименование",			ПредставлениеКолонки,			"НоменклатураСсылка",			30);
	
	ПредставлениеКолонки = НСтр("ru='Полное наименование';ka='დასაბეჭდი სახელწოდება';en='Full name'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "НаименованиеПолное",	"Полное наименование",	"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "НаименованиеПолное",	ПредставлениеКолонки,	"НоменклатураСсылка",			30);
	
	ПредставлениеКолонки = НСтр("ru='Описание';ka='აღწერა';en='Description'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Комментарий",			"Описание",				"НоменклатураСсылка",			30);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "Комментарий",			ПредставлениеКолонки,				"НоменклатураСсылка",			30);
	
	ПредставлениеКолонки = НСтр("ru='Характеристика';ka='მახასიათებელი';en='Characteristic'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, ИспользованиеХарактеристик, "Характеристика", "Характеристика", "РасшифровкаХарактеристика", 14, ИспользованиеХарактеристик);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, ИспользованиеХарактеристик, "Характеристика", ПредставлениеКолонки, "РасшифровкаХарактеристика", 14, ИспользованиеХарактеристик);
	
	ПредставлениеКолонки = НСтр("ru='Страна';ka='ქვეყანა';en='Country'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "СтранаПроисхождения",	"Страна",				"НоменклатураСсылка",			7);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Истина, "СтранаПроисхождения",	ПредставлениеКолонки,				"НоменклатураСсылка",			7);
	
	ПредставлениеКолонки = НСтр("ru='Свободный остаток';ka='თავისუფალი ნაშთი';en='Free balance'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"СвободныйОстаток",		"Свободный остаток",	"НоменклатураСсылка",			10);
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"СвободныйОстаток",		ПредставлениеКолонки,	"НоменклатураСсылка",			10);
	
	ПредставлениеКолонки = НСтр("ru='Штрихкод';ka='შტრიხკოდი';en='Barcode'");
	//ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"Штрихкод",				"Штрихкод",				"НоменклатураСсылка",			17); //++Lazare 
	ДобавитьСтрокуВТаблицуРеквизитов(ДоступныеПоля, Ложь,	"Штрихкод",				ПредставлениеКолонки,				"НоменклатураСсылка",			17); //++Lazare 
	
КонецПроцедуры

#КонецЕсли
